#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "80d40f6b2398afa2e3a08bc5538c94d8" -> "d866070ba1d2df37ff24da9430b185bd"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "6e90484feda1888f31c71642c1e04d75" -> "f196ff15f9df20d00e7c1ba17ffe29a6"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "c1a453262c15c1282ef3810ccaf67c84" -> "924223f518b35b35ddc0f90a988c5197"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "2d7f1d1dd7ee4a150357773337bb920d" -> "1b953d58cbc9639bc55bbf2b7bec16b3"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "de8bf7ac1853499917e738ce032dc16c" -> "d979601039f8bad6d9f9dfb58918ae9c"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "0501ccafe58809bcbbd694b3e9dafbdb" -> "2ee21684698a167d13b36077c1cbb886"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "62d13e86aa235fb0b4d9bb22d517758b" -> "4eb60f4f455f5beabee211cb05b1d86c"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "fa8d5328596c44e77ed0e669913b0122" -> "82b18a67de710070298c1bee3b476fbb"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "2f6f35b6e706e1110ef411669af7547a" -> "3ed6bba514724d73e6f445bc26fb1560"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "09cae3e624c88f148a53f9bf83d85f49" -> "17644ae30cbcaba35d5eb451c5d25e5f"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "c800b7c4cb853e43c5ff571c012a8d3d" -> "ce8297f8c7692275fb7bdcfc317d3307"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "328f816783e1dbec4921714e72d4f4d7" -> "2c785280ce559c8a5acfecbf9a2b4827"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "a5078d9af7a729e6adf3ff86350cf725" -> "5db207c062e5aa268b2545e581cb75f9"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "cfa7530a1aa6edeb37e7cf836826735d" -> "270129c7c9d43b5e3c0184440c4d53f3"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "5ac73b560537c336d9e5ab8d0c720305" -> "5fec933c316e1c7157ffca421102603f"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "c7664b881ef5eb02aedf7e94d54338b5" -> "400454d31303ed1ca8b08843be3b7642"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "627b50f767548b59d865cfb162cdf664" -> "009130d2745a897fbb38c07e5369a9fa"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "f12f668ab03d7f1887f0c32341d03fa5" -> "c7dd01cdca0daa92f7f88fd96f2ee30f"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "df20c594c5ba3878cb289f2092b97dc6" -> "912248eb596a9a30bc55dd9c0caf15fe"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "96471538b0e23956571e02d8160b7382" -> "8b3b8aaeb9fbcae1ed76f1521ef78ec1"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "b7e48c468b7e5ef36d2a0d60635cbcbe" -> "00f6a807ea785ddebd43ccca7ac99a81"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "8908960f88ce40fcdb1ffec207cbb0ad" -> "1dea618d1f1fe1db7b32c756750b9f0d"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "94fe860ded3d3997eb8ca3763101a655" -> "1f269fe7ac3c9e4325c9abe56ad7b06f"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "14acccac546748ee53c111f69329164f" -> "bab88a852221dd5e03e9077629ac7c8d"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "6b70f32f3c1f118b6f00883494bde79f" -> "61bd90a8244a36100ef8f2c0b9ee481f"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "97a04186891c2841735416717409e486" -> "fb09b31d8cb3a4749e05f2151207e117"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "0a99aed4951ece5edf351a8736994b53" -> "0d847256d8496e4d5940df0615c4287c"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "262275cbf1357627b34f965aaeebeb7b" -> "7418cd8da4857f5f736a566859b8a8dd"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "974e6bf3ca6b64326678ab1b6cbff75f" -> "b9b638706338bc8a4f515ac95e31a3ad"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "6b686393d1d59e43afce68795ddec703" -> "1781a26816c0193ec874658246e1f010"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "969325bac554ef69f88d232a4896071d" -> "eece86407c34925b7399908fdedc78b8"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "6c435f4ee958e551ad441ed96462152a" -> "5e9ce89cc459d22e1b016b640e958a73"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "d120accceafbbf432b14c21f454c9e1d" -> "973dbb2f97c54cfb3395354904c3b3fa"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "db361e87a2bfefe0588871f4acb435d6" -> "53046bd3ba7c9c4f924a93436604cf4b"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "969942d72977fa2062d81387362469a7" -> "1e70ee55241fc989a3c59bb2e53d9634"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "fed4842405a1fc530b169c7f1d33ba96" -> "106c0d0315b0bc76e49bb82b012930ab"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "2a5e1e2991f0221dd62e0a10acb40eaf" -> "d46fffde369d65f0f3d0e864a31db3a7"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "b8d420a74277c014252865a8753f1eb9" -> "19763647746f342019674fee991458f2"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be created
  + resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "3c0913ac0fef3aeeb531f6075dd5f4ad"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/modify_ranges_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/modify_ranges_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "c859bcc45e73cb5ff16cfe041f16c426" -> "f736e1f91ba7ce7f4a0b407c04bbe121"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "f4f4e3ec69473e3ed30bcf619ec11644" -> "b6f67f59da699806bc5bb6c591988f52"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "5573c37f3048302272bb101d10016aac" -> "3976cc65a1539938818807af48fb506b"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "08e18a3a66a12fd91d00cd9d4a33b937" -> "93fcc87f2bceb79a9b8c4ff822666541"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "01321b1e9b306a11503b214c19dce63f" -> "5882673b54e288cdfcf40a7f7f338c19"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "8b03e919e09f0ef9691a6420114c1823" -> "fb78f1694f1ab5dcc58e80f7e685161a"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "pz3htoD0yNlo6x0SHrigBiBUo7gdUoxPY/Ku3K2Atbc=" -> "0kJOm6GQGgQqSeMWZLxaqRjuzOoMlX3ULynXL4YQzMk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "uFbf4lqphaxxooKg/ZhertyLxix14CspjtI9hI3fDQo=" -> "g54SRY3nEBmDhtOKWdXLQXFqEU/PZPLFli1LS+6SYWM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "SbNUI5QYL84E99oTrv26R2DSJnXJpzZu4AtD95fYuGE=" -> "gAyFW/rcUvYJ1Rww0I8+T4vOYMVCHtj092GdEZ3XVnA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "FOk5rgRrWLFbS195sL1zgZsmlsGomSBZsC583ngQteQ=" -> "UThboVS6sTZQ9HzWgqzNM5b2AYB6Eq05pDOi5kxorp8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "7uWq7APVF/i42CJSxe4ZbAFEySLMX6szl7npcR8zYQg=" -> "4JlARBJhrO7dVOQwtj/iBUPsxxPHjBm9Fs4Fm5IZ1u8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "V8DJPePO2ysYdgJlvePikqKyT8bBqM6jEAeUq0Z35DU=" -> "5TYgVDsMnpfI/eIJ1nVyjw7bZ5rrokylicocfPpYJqQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "M0qv/E7aSFeRKn19Q81eAk1yr4/ugKD7hk1z2rFFp88=" -> "rhPLFMWbI0PY0/dwUOJHNP2+enHFDciGPSgsZAGNXmo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "gKNcksXN0wa8i/FXKkJ8FEyp9wCI/Tg3UwwsvobYWdM=" -> "/9tW27VCGZzdad8/BWxG6IZlJtZh+7K8wNh4tl81P8I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "72nnnjaxAOm3s5N6rweO0T8LVl9dYPyC8LRdpRXw+Ug=" -> "B+nB/SV8289oNwZO8oh/NkpLxeu0uz3lnqvbSsiKF18="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "Cx3ej0kRI4s/vC172/kIgVXKpt52eo69+sgXAE0HRtQ=" -> "t9MdAnzOIE+V1e8v/e6rludBd2AKsxiKLEeItmUwnYI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "Tq7tJtoO6oWppe0inIpIZ1vXDNtvtJ7BXHLzeOOnGJE=" -> "i8ADvgQLlgdabdIlPNiza1OGOWU8kju60ncMHcvF7QE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "cjwN3AHZzZYnKc3oKP4EYLk9rgaOc7hmRXbjx07HrZk=" -> "5iHECwPS0e0oZr4J/Y2p1lywQPiLyGULWzLIxoDohKs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "gjaICGuKDu4YwCpm/taQjAkT30g32Xa4/ZnZrDrBRrA=" -> "JEJlE5BulcKCBLtEajnBE9Eqk0Som4mYkn5QgDQwJmY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "EH9ONU4wEjTC65k4bkYg4xSo8VFBuDHlMC4OwWb2nuM=" -> "BXnNRB6APVQ7AZX8FhQjFTUUCSc6VzWij3kgDFw5Jjw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "83gNft9CciqnCfkFirTLxVKC+jAzZ3/707gwQqGMpio=" -> "mjQnW8WGyU6usPAjOeSRAjVYOp0g37j2vtOkh8gyAWI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "u9wCH7HjzkFrgjZ3HTVqKcBkLqvJGbFJ2LNqbIBzKMs=" -> "mT2p4UNjb1lR3+0NiszTkOobIJmvYFFoXTQ582Hl++0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "HeA+IRwBQzOATdr3YG1G7RKYRG7J/HD2srDMAYplr8U=" -> "JgWkUuXWBOETI48jDkEKw9PqhAiMgyUhQ8HqrnNDQ0w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "ztYVVIXBG0LCnk9bOKqqYWKuRaJLow/Jmz9KSOrYki4=" -> "D7B8c9+yuSnZ7e1mdwO9lV/8xPBWez8Od5Y5wIi/GUE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "EkUpleTTnZK4EQQYUz5vBZygzmKp8W2/hqiLhP+tLDc=" -> "A8itElHnrQNoI8i7NqN4PaxdpOFXg2H0iJRa2+xGB7A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "nlXDSgWSqKuoPdCBse9eMaj1t26p6lzXHWQwrRHCcNk=" -> "awXukf4vb8vGH67VVFIRFDUgHUWcIx53HUvmdiHY4g0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "deIbtMjgQiefvsWkBApK/2afkVKPeK1UiBlJaN6aMcM=" -> "5QAmMG2iLzPR/98z+tI6F1z8qs/pvM9DlDRKPFTL6kE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "qjeeELthImR/KTjs/UzYiSBOWPyr652GErsebgN6AaU=" -> "DzaVAyv004LEU39lJoetrTs+ypiqlUHGbqW3450/lg4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "fBzD2YiadsPROd8U28Fxg5thT2qbxOrRo/Ureod2IWI=" -> "nMNlOgj2CMc/hGv+MG20B11Qz33C/gwVH1CUWyMklHE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "AHcCUCTQBphwcSzRlmV+ShbE3UK/c+bia1mmmMZLqKU=" -> "GW9tbY7cpdcUCWPYERmfG2SiIcsleGntRWW9C1fWzrM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "DX5KKbPwZjRN36Iv2luKiNn8T7G3mslgQUCrVP3Ch9E=" -> "S7DEknUDbi4rdNq1VhjL8Q5uieDjNh3pLsHcj3QH7Q8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "kfFSidhWh0eF/0CPXIj8YcjSlj1vsDEZiFq6EIyOxm8=" -> "fyTvXE044WD7AM6N/hNUqmyiBEo894xUSdsE+PqQiFA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "La7Z4T5jatluSRSKnJymLur3BNaZnGAM4NcNB9lzjCM=" -> "kVz7tw7db6TLJxcK1F2t/twQ633kIpJjBnzW+w0UZ3U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "AvnP03wLKF4ZCXvJQcLOih6weaO0tmEAfAkFbKMvXnA=" -> "Vaf61ztN6fFse6hdZmFtfRscHfN8TrpmEpTG2pX9HSg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "/a6m0Fg2e+yD+W2HMvt/KcP8sqnWdxeJ6+C1sfN8nB0=" -> "8iweuG/ttuTZwk4Grhwd54wBCqHNC6K+i0Q3Q1dW2A4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "hrPh+qbjepVjFqR/ms/QN5v/y+YIwTML7Kz639PMncI=" -> "R1x/5Wtm7313iA1wQuZjdNa7P0jClVHpYGwx+OQAt/w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "ry3D4SuqfJXyFQEBbDJikMTsc+iid968GTDE12Dym7o=" -> "kNznecBnOyppxSp0TW4oGjnhATe1rU6TGf5XNWnuQAs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "ayMrDZVaN2uri1daMpHUdNS/cKQMiyjGL8mTKEvXwmo=" -> "uuiTsocxsEL0uVkYzctAQL2STYq+x2tLNlp/UmlTu+o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "P+1qxqARajc3jpyh4hZfu5edrDafIkSmra8zSNaaPg8=" -> "MGwO2lwaPQEt4iZkci0NzYGw9PSTMyfbyLagoimMxao="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "pywKnu6y00eoREjkmVxmN1AUqAxp9FpWq9SfPVlqSUE=" -> "2VaypCc3sMlhTIVvRI4Q0IKycJS7hXhuyKQAiWQ4Deo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "u65H4hUOS+Fs5subesztK0fmevWmicwYirYTAZSGySA=" -> "Y3/3/o+rf78uVXp0rw/iOWl6JVdK9TzyUarM7gANbmQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "SdA9ZoqQxAWMRFhnd+cxv594QkuF2QTc9QzDMghe3cs=" -> "zfhxepX0KWuXLQaRapv5WigA3SMww0f7nu0UdHB/2+A="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "3lND2H6LF16D8D1jM7DbuH+eAuGgF186ClfBfEvXWLY=" -> "6+eVc4bRTnCRNrFOD5lVqGs6DL8aQ9MPMl76ArG64T8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be created
  + resource "aws_lambda_function" "modify_ranges_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_modify_ranges_lambda_function"
      + handler                        = "modify_ranges_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/modify_ranges_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "AUf7GDJrLCYcIAwhtl1akI/AWwUpA17HnswqjDjta4w="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_KEY"   = (sensitive)
              + "DB_HOST"      = (sensitive)
              + "DB_NAME"      = "demokpinetworkdb"
              + "DB_PASSWORD"  = (sensitive)
              + "DB_USERNAME"  = (sensitive)
              + "SECRET_KEY"   = (sensitive)
              + "USER_POOL_ID" = "us-west-2_usXw4S12D"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "glz/flXmItcDZ7p8Oqo/MEAxP88dFD3I59MeC3/fjUY=" -> "qqxiVxtgh37ZT29o2drC17ikN7PlMPBvEgCzC/n6Dk8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "9DF5NccVpymq830SRBsYeaLKbPk/k5vHlc97UfMnzuU=" -> "wHPWsma6EeZ4vqbmWGUpxdwtt0RBXYUHHruo8LEjI6Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "Wygx505fhv8BSn+Vfuk1r+6bbLB3DVnW5J84+VV1Xzw=" -> "wo+tw63WDpraFtKd2KlShYDS3HJTQk6p9nL43It0vro="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "wOO+YHgAF5dRu2QJwZ99289sLJ+lIqCX7DaY3GNSeWc=" -> "xJXFEI94pnl0ZUh+7P0W6d040o4oMeo/ppbyDuoh6Yc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "C5tjjrynkpihF2ulYNusG6ZoAVt37Y5oXZWL0gAzlk8=" -> "mTpzRIYuwaCeosOD+bIvYki5bvN0Y6JB2uITQQ67gEQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "EGvlWfq0aPsTOzU4plwNBuz4cNwrCFgLTULB7ju3HHU=" -> "Ef5N3EmcteFMYEqp8HqA/BB3pdNHnG3e8ElEcg5VFbc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-11-08T22:46:33Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "v9bqr6" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-11-08T22:46:31Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.logs.aws_cloudwatch_log_group.modify_ranges_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "modify_ranges_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_modify_ranges_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.network.aws_api_gateway_integration.modify_ranges_integration will be created
  + resource "aws_api_gateway_integration" "modify_ranges_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "PUT"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "xqe34y"
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_method.modify_ranges_method will be created
  + resource "aws_api_gateway_method" "modify_ranges_method" {
      + api_key_required = false
      + authorization    = "CUSTOM"
      + authorizer_id    = "3y14fs"
      + http_method      = "PUT"
      + id               = (known after apply)
      + resource_id      = "xqe34y"
      + rest_api_id      = "kb7gblbu69"
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-11-08T22:46:31Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

  # module.policy.aws_iam_role.modify_ranges_lambda_exec_role will be created
  + resource "aws_iam_role" "modify_ranges_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo_modify_ranges_lambda_exec_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role_policy.modify_ranges_cognito_policy will be created
  + resource "aws_iam_role_policy" "modify_ranges_cognito_policy" {
      + id     = (known after apply)
      + name   = "demo_modify_ranges_cognito_policy"
      + policy = (sensitive)
      + role   = (known after apply)
    }

  # module.policy.aws_iam_role_policy_attachment.modify_ranges_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "modify_ranges_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function"
      + role       = "demo_modify_ranges_lambda_exec_role"
    }

  # module.policy.aws_iam_role_policy_attachment.modify_ranges_lambda_vpc will be created
  + resource "aws_iam_role_policy_attachment" "modify_ranges_lambda_vpc" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function"
      + role       = "demo_modify_ranges_lambda_exec_role"
    }

  # module.policy.aws_lambda_permission.apigw_modify_ranges_lambda will be created
  + resource "aws_lambda_permission" "apigw_modify_ranges_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "demo_modify_ranges_lambda_function"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (sensitive)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

Plan: 11 to add, 89 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*